[
  {
    "header": "April 11, 2016",
    "body": "<p>The plan after re-doing Photographic Memory was to move onto a larger project to test out some of the other tools that are being used in the <a href=\"https://facebook.github.io/react/\">ReactJS</a> world. However, I was side tracked by this site. I went to write about <a href=\"https://photographic.herokuapp.com\">Photographic Memory 2.0</a>, add it to my <a href=\"https://Terit.github.io/resume\">Resume</a> and <a href=\"#portfolio\">Portfolio</a> and wasn't satisfied with the process. So like anyone with a big rock I spent a few days reworking it to use React!</p><p>To start this one I decided, based on my experience Googling, to use Webpack instead of Gulp to compile this project. Looking back I don't know if I've made the correct choice. I didn't have a great understanding of Gulp to begin with so now is the time to pick a tool and stick with it. Webpack seems to be the build tool of choice right now in the React community, and that certainly helped me get through setting up a working project. It wasn't an easy journey, but I got there with some help by reading a few blog posts. Special thanks to this one <a href=\"https://medium.com/@rajaraodv/webpack-the-confusing-parts-58712f8fcad9#.7805n6a4i\">by Raja Rao</a> which pointed me in the right direction regarding this site's file structure. There's still some things I could do better like using the HTML plugin and templates instead of hand writing each of my two pages, or figuring how to point my CSS rules to the correct 'images' directory on build.</p><p>After struggling with the Webpack, creating React components was easy and fast. I DRYed up my pages and I was able to extract the parts of my site into JSON objects, which are easier to update and require little boilerplate code. Overall it was good practice in writing simple React components and appreciating a simple application that has no state change.</p><p>Up next, MLB scoreboard...</p><p>Some other helpful links for Webpack: <a href=\"http://survivejs.com/webpack_react/\">SurvieJS Webpack React</a>, <a href=\"http://rwhitmire.com/2016/04/09/webpack-for-beginners.html\">Webpack for beginners</a></p>"
  },
  {
    "header": "April 8, 2016",
    "body": "<p>Recently I've been playing with <a href=\"https://facebook.github.io/react/\">ReactJS</a>. I started my journey by finding a few tutorials to pick up the basics. Doing so I realised my Javascript skills were a little rusty, working mostly in Ruby at <a href=\"https://mybesthelper.com/\" target=\"_blank\">myBestHelper</a> and most of our Javascript is written in <a href=\"https://jquery.com/\">jQuery</a>. Familiarizing myself with vanilla JS allowed me to better follow along with the concepts and strength of ReactJS.</p><p>Once the tutorials had done their job, I started to think about ways I could test my new skills. That led me to my favourite project I wrote at Lighthouse Labs, <a href=\"https://photographic-memory.herokuapp.com\" target=\"_blank\">Photographic Memory</a>! I always liked working on that project because the game was so fun to play. That is why I was so motivated to complete the game again. It was also the project where I wrote the most javascript.</p><p>Reflecting on the project, I think I made a great choice. With so much state changing throughout the game I got a much better understanding of React component state, props and the React API. It also allowed me the chance to break my page into smaller and smaller components as I went along. I also got a chance to try my hand at ES6, Babel, and Gulp; more things I wasn\"t very familar with before I started this.</p><p>Check out the finished version <a href=\"https://photographic.herokuapp.com\" target=\"_blank\">here</a> or the repository <a href=\"https://github.com/terit/react-photographic-memory\" target=\"_blank\">here</a>.</p><p>Up next I'm going to rewrite another Lighthouse Labs project, Rotten Mangoes. I think it's a good chance to try a more robust project with user accounts, multiple database models and a more complex application. It will also give me a chance to write a Node.js API server with the possibility of a universal/isomorphic refactor in the future.</p><p>Stay tuned for more.</p>"
  },
  {
    "header": "Welcome 2015",
    "body": "<p>Welcome to my site, have a look around you might see something you like. If you do feel free to contact me through <a href=\"https://www.linkedin.com/in/andytheriault\" target=\"_blank\">LinkedIn</a> or email me directly <a href=\"mailto:andy@terit.tech\" target=\"_blank\">here</a>. My career as a web developer is just getting started so check back regularly as I update my profile.</p><p><Current></Current>ly I'm working for <a href=\"https://mybesthelper.com/\" target=\"_blank\">myBestHelper</a>, a company which helps families find babysitters, nannies or any sort of helper they need.</p>"
  }
]




